import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:project_final/style_widgets/scaff.dart';

import 'model/model_project.dart';
import 'movies_detail_pages.dart';

var descriptionStyle = const TextStyle(
  fontSize: 12.0,
  color: Colors.black54,
);
var amountStyle = const TextStyle(
  fontSize: 16.0,
  fontWeight: FontWeight.bold,
  color: Colors.black54,
);

class MoviesListPage extends StatefulWidget {
  const MoviesListPage({Key? key}) : super(key: key);

  @override
  State<MoviesListPage> createState() => _MoviesListPageState();
}

class _MoviesListPageState extends State<MoviesListPage> {
  List<Project> projects = [
    Project(
        moviesName: 'ธี่หยด',
        Director: 'ทวีวัฒน์ วันทา',
        news:
            'ธี่หยด 26 ตุลาคมนี้ ครั้งเเรกของหนังไทยบนจอยักษ์ IMAX สามารถรับชมได้ที่โรงภาพยนตร์ทุกสาขาทั่วประเทศ',
        Rate: 121,
        type: 'สยองขวัญ',
        playerName:
            '\nนักเเสดง : ณเดชน์ คูกิมิยะ , เดนิส เจลีลชา คัปปุน, กาจบัณฑิต ใจดี, พีระกฤตย์ พชร บุณยเกียรติ, ณัฐชา เจสสิกา พาโตวัน,  รัตนวดี วงศ์ทอง',
        imageUrl: 'assets/images/movies1.png',
        report:
            'ปีพุทธศักราช ๒๕๑๕ เกิดเหตุการณ์สุดสะพรึงขวัญขึ้น เด็กสาวในหมู่บ้านห่างไกลแถบ จ.กาญจนบุรี เสียชีวิตอย่างเป็นปริศนา ข่าวเด็กสาวตายอย่างน่าสยดสยองแพร่สะพัดไปอย่างรวดเร็ว ในขณะเดียวกัน หลังจาก "ยักษ์" ปลดประจำการ เขากลับมาช่วยงานที่บ้านตามคำสั่งของผู้เป็นพ่อ "หยาด" น้องสาวของยักษ์ สัมผัสได้ถึงภัยเร้นลับที่คืบคลานเข้ามาในหมู่บ้าน เมื่อ "แย้ม" น้องสาวของเธอเริ่มมีอาการแปลก ๆ หลังจากเจอหญิงชุดดำลึกลับ ระหว่างกลับจากโรงเรียน อาการของแย้มทรุดลงเรื่อย ๆ พร้อมท่าทีประหลาดอย่างหาคำตอบไม่ได้ บทสรุปเรื่องเล่าที่เป็นตำนาน หญิงชุดดำที่มาพร้อมกับเสียง “ธี่หยด” ความน่ากลัวที่ไม่มีวิธีรับมือ ความสยองที่คืบคลานเข้ามาสู่ครอบครัวนี้อย่างไม่มีเหตุผล ยักษ์จึงต้องทำทุกวิถีทางเพื่อให้แย้มหายจากอาการประหลาด และทำให้ครอบครัวมีชีวิตรอดไปจากเสียงเพรียกสยองยามค่ำคืน... สัมผัสประสบการณ์หลอนกว่าที่เคย!'),
    Project(
        moviesName: 'สัปเหร่อ',
        Director: 'ธิติ ศรีนวล',
        news:
            'สัปเหร่อ 5 ตุลาคมนี้ สามารถรับชมได้ที่โรงภาพยนตร์ทุกสาขาทั่วประเทศ',
        Rate: 125,
        type: 'สยองขวัญ',
        playerName: '\nนักเเสดง : ณัฐวุฒิ เเสนยะบุตร , ชาติชาย ชินศรี, ',
        imageUrl: 'assets/images/movies2.png',
        report:
            'เป็นเรื่องราวที่เกิดขึ้นในหมู่บ้านโนนคูณในจักรวาลไทบ้าน เล่าถึงชีวิต เจิด เด็กหนุ่มวัย 25 ปีที่เรีนนจบกฎหมาย 7-8 ปี มีพ่อทำอาชีพ สัปเหร่อ เขาหวังจะไปสอบเป็นทนายหรือปลัดอำเภอ แต่ต้องมาช่วยพ่อเป็นสัปเหร่อ เพราะพ่อมีอาการป่วยจนต้องมาช่วยพ่อทำงาน แต่ลังเลเพราะเกิดเป็นคนที่กลัวผีมากๆ และต้องมาทำงานกับศพเซียง ผู้อกหักจากคนรักและพยายามบวชเพื่อลืมแฟนเก่า (ใบข้าว) แต่สุดท้ายต้องมาเจ็บปวดเพราะใบข้าวตาย และทำใจไม่ได้จึงหาวิธีที่จะเจอ กับใบข้าวในโลกหลังความตาย จึงเรียนรู้และศึกษาทฤษฎีต่างๆ เกี่ยวกับการเจอคนที่ตายไปแล้ว ไปปรึกษาพ่อเจิดที่รอการทำพิธีถอดจิตไปโลกความฝันสามารถเจอคนที่ตายแล้วได้ พ่อเจิดมีข้อแลกเปลี่ยนในการทำพิธีให้โดยเซียงต้องมาช่วยเจิดทำงานสัปเหร่อ เพราะเจิดเป็นคนที่กลัวผีมากๆ และต้องมาทำศพแทนพ่อ เซียงเป็นคนสุดท้ายที่พอจะได้ทำพิธีถอดจิตให้ก่อนตาย สุดท้ายทุกอย่างมีเวลาของมัน มันคือธรรมชาติของความจริง ทุกคนเรียนรู้และเข้าใจการยื้อและการเสียคนที่รักจากไป'),
    Project(
        moviesName: 'เพื่อน(ไม่)สนิท',
        Director: 'อัตตา เหมวดี',
        news:
            'เพื่อน(ไม่)สนิท 26 ตุลาคมนี้ สามารถรับชมได้ที่โรงภาพยนตร์ทุกสาขาทั่วประเทศ',
        Rate: 123,
        type: 'ชีวิต',
        playerName:
            '\nนักเเสดง : ณัฐทิชา จันทรวารีเลขา , อันโทน่ บุยเซอเรท์, ธนกร ติยานนท์, พิสิฐพล เอกพงศ์พิสิฐ, อิงครัต ดำรงค์ศักดิ์กุล, ปราโมทย์ แสงศร, นฤมล พงษ์สุภาพ, ดวงใจ หิรัญศรี, กิตติพงศ์ ทุมวิภาต ',
        imageUrl: 'assets/images/movies3.png',
        report: 'เมื่อภาพยนตร์(ไม่)สั้น เหวี่ยงทุกคนให้มาเป็นเพื่อนกัน'),
    Project(
        moviesName: '5 คืนสยองที่ร้านเฟรดดี้',
        Director: 'เอ็มมา เเทมมี่',
        news:
            '5 คืนสยองที่ร้านเฟรดดี้ 26 ตุลาคมนี้ สามารถรับชมได้ที่โรงภาพยนตร์ทุกสาขาทั่วประเทศ',
        Rate: 5,
        type: 'สยองขวัญ',
        playerName:
            '\nนักเเสดง : Elizabeth Lail, Josh Hutcherson, Matthew Lillard',
        imageUrl: 'assets/images/movies4.png',
        report:
            'เรื่องราวของเจ้าหน้าที่รักษาความปลอดภัยที่ตกอยู่ในความลำบาก เมื่อเขาเริ่มทำงานที่ร้านพิซซาเฟรดดี้ ฟาซแบร์ ขณะที่เขาใช้เวลาคืนแรกในการทำงาน เขาตระหนักดีว่าการทำงานกะกลางคืนที่เฟรดดี้นั้นไม่ใช่เรื่องง่ายที่จะผ่านพ้นไปได้'),
    Project(
        moviesName: 'เรดไลฟ์',
        Director: ' เอกลักญ กรรณศรณ์',
        news:
            'เรดไลฟ์ 2 พฤศจิกายนนี้ สามารถรับชมได้ที่โรงภาพยนตร์ทุกสาขาทั่วประเทศ',
        Rate: 120,
        type: 'ชีวิต, สยองขวัญ',
        playerName:
            '\nนักเเสดง : ธิติ มหาโยธารักษ์ , อุกฤษ วิลลีย์ บรอด ดอนกาเบรียล, สุพิชชา สังขจินดา, กรองทอง รัชตะวรรณ, สุมิตตา ดวงแก้ว, กานต์พิชชา พงษ์พานิช, มานพ มีจำรัส, วัชระ ณ ระนอง',
        imageUrl: 'assets/images/movies5.png',
        report:
            'เรื่องราวของสองหนุ่มสาวที่โลกลืม - “ส้ม” (ซิดนีย์ สุพิชชา) ลูกในโอวาทของ "อ้อย" (ปู กรองทอง) โสเภณีข้างถนนที่ชีวิตต้องเปลี่ยนไปหลังตกหลุมรัก ‘พีช’ (ฝ้าย สุมิตตา) รุ่นพี่ไอดอลสาวผู้ทิ้งเรื่องราวปริศนาไว้ และทำให้ส้มได้รู้จักกับความรัก ความผิดหวังและการสูญเสีย ขณะที่ “เต๋อ” (แบงค์ ธิติ) โจรกระจอกที่เฝ้าปล้นหาเงินเพื่อสร้างชีวิตใหม่กับ “มายด์” (จ๋อมแจ๋ม กานต์พิชชา) ผู้หญิงที่เขาทุ่มความรักให้ แต่สุดท้ายเงินกลับช่วยอะไรเขาไม่ได้ และยิ่งทั้งสองพยายามมากเท่าไรก็ยิ่งพบว่าตัวเองกำลังเดินทางเข้าสู่หนทางทึ่คาดเดาไม่ได้มากขึ้นเท่านั้น'),
    Project(
        moviesName: 'ดิจิมอน แอดเวนเจอร์ 02',
        Director: 'Tomohisa Taguchi',
        news:
            'ดิจิมอน แอดเวนเจอร์ 02 2 พฤศจิกายนนี้ สามารถรับชมได้ที่โรงภาพยนตร์ทุกสาขาทั่วประเทศ',
        Rate: 80,
        type: 'แอ็คชัน , ผจญภัย , แอนิเมชัน',
        playerName:
            '\nนักเเสดง : Fukujuro Katayama, Junko Noda, Arthur Lounsbery',
        imageUrl: 'assets/images/movies6.png',
        report:
            'ปี 2012  หลังจากการผจญภัยในโลกดิจิทัลผ่านไป 10 ปี  จู่ๆ ก็มีดิจิทามะขนาดยักษ์ปรากฏขึ้นบนท้องฟ้าเหนือโตเกียวทาวเวอร์  พร้อมกับข้อความหนึ่งที่ปรากฏขึ้นทั่วโลก คือ “มอบเพื่อนให้กับทุกคน ส่งดิจิมอนให้กับคนทั้งโลก” ไดสุเกะ และเพื่อนๆ กำลังรวมตัวกันอยู่ที่ร้านราเม็ง เห็นข่าวในทีวีว่ามีชายหนุ่มคนหนึ่งกำลังปีนโตเกียวทาวเวอร์ ในมือมีดิจิไวซ์  พวกไดสุเกะจึงตามไป และได้พบกับ รุย ซึ่งบอกว่า เขาคือ มนุษย์คนแรกที่  ผูกสายสัมพันธ์กับดิจิมอน แต่ตอนนี้เขาไม่มีดิจิมอนอยู่ด้วย เพราะรุยเชื่อว่ามนุษย์กับดิจิมอนไม่ควรพบกัน  เป็นเพราะเหตุการณ์ในอดีตที่เกิดขึ้นเมื่อ 15 ปีก่อน รุย เด็กชายอายุ 4 ปี ได้พบกับดิจิมอน ชื่อ อุ๊กโกะมอน ในวันเกิดของเขา อุ๊กโกะมอนสัญญาว่าจะเป็นเพื่อน คอยดูแลและปกป้องรุย ช่วยทำให้รุยมีเพื่อนเยอะๆ แต่ต่อมารุยก็พบว่า สิ่งที่อุ๊กโกะมอนบันดาลให้ไม่ใช่สิ่งที่เขาต้องการ  รุยจึงตัดสินใจทำให้อุ๊กโกะมอนหายไป และตอนนี้ อุ๊กโกะมอนก็ได้กลับมาอีกครั้งเพื่อทำตามสัญญาในวันเกิดของรุย นั่นคือ บังคับให้มนุษย์ทุกคนบนโลกผูกสัมพันธ์กับดิจิมอน จะเกิดอะไรขึ้นเมื่อคำสัญญาที่ให้ไว้ในอดีต ได้รับการสืบทอดผ่านกาลเวลา ซึ่งเกี่ยวข้องกับพวกไดสุเกะ และเด็กผู้ถูกเลือกคนอื่นๆ ทั่วโลก ไดสุเกะและเพื่อนๆ รวมทั้งดิจิมอนคู่หู จึงต้องรวมพลังกันเพื่อจัดการเรื่องนี้ให้เรียบร้อย โดยมีสายสัมพันธ์ของพวกเขากับดิจิมอนคู่หูเป็นเดิมพัน '),
    Project(
        moviesName: 'คิลเลอร์ส ออฟ เดอะ ฟลาวเวอร์ มูน',
        Director: 'Martin Scorsese',
        news:
            'คิลเลอร์ส ออฟ เดอะ ฟลาวเวอร์ มูน 19 ตุลาคมนี้ สามารถรับชมได้ที่โรงภาพยนตร์ทุกสาขาทั่วประเทศ',
        Rate: 205,
        type: 'อาชญากรรม , ชีวิต',
        playerName:
            '\nนักเเสดง : Leonardo DiCaprio, Robert De Niro, Lily Gladstone',
        imageUrl: 'assets/images/movies7.png',
        report:
            'เมื่อนํ้ามันถูกค้นพบในยุค 1920s ที่รัฐโอคลาโฮมา ในพื้นที่ของชาวพื้นเมืองโอเซจ ชาวโอเซจจึงถูกฆาตกรรมไปทีละคน จนกระทั่งเอฟบีไอเข้ามาไขปริศนาดังกล่าว'),
  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
          title: Row(
            children: [
              const Icon(Icons.movie),
              Padding(
                padding:
                    const EdgeInsets.symmetric(vertical: 0.0, horizontal: 8.0),
                child: const Text('ภาพยนตร์เเนะนำในปี 2023'),
              ),
            ],
          ),
          automaticallyImplyLeading: false),
      body: MyScaffold(
        child: ListView.builder(
          itemCount: projects.length,
          // Callback function
          itemBuilder: (BuildContext context, int index) {
            var project = projects[index];

            return Card(
              child: InkWell(
                onTap: () {
                  _handleClickProjectItem(projects[index]);
                },
                child: Padding(
                  padding: const EdgeInsets.all(16.0),
                  child: Column(
                    crossAxisAlignment: CrossAxisAlignment.start,
                    children: [
                      Row(
                        crossAxisAlignment: CrossAxisAlignment.start,
                        children: [
                          Image.asset(
                            project.imageUrl,
                            width: 64.0,
                            height: 64.0,
                            //fit: BoxFit.cover,
                          ),
                          const SizedBox(width: 10.0),
                          Expanded(
                            child: Column(
                              crossAxisAlignment: CrossAxisAlignment.start,
                              children: [
                                Text(
                                  project.moviesName,
                                  overflow: TextOverflow.ellipsis,
                                ),
                                const SizedBox(height: 8.0),
                                Text(
                                  project.news,
                                  style: descriptionStyle,
                                  overflow: TextOverflow.ellipsis,
                                  maxLines: 2,
                                ),
                              ],
                            ),
                          ),
                        ],
                      ),
                      const SizedBox(height: 8.0),
                    ],
                  ),
                ),
              ),
            );
          },
        ),
      ),
    );
  }

  void _handleClickProjectItem(Project p) {
    Navigator.push(
      context,
      MaterialPageRoute(builder: (context) => MoviesDetailPages(project: p)),
    );
  }
}
